In [2]:
import pandas as pd

dt=pd.read_html("Demo.html")

In [3]:
dt

[      Name  Age         City
 0    Alice   25     New York
 1      Bob   30  Los Angeles
 2  Charlie   22      Chicago]

In [4]:
df=pd.read_json("sample.json")

In [5]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   22      Chicago

In [6]:
at=pd.read_xml("Example.xml")

In [7]:
at

      name  age         city
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   22      Chicago

In [15]:
st = pd.read_excel("SampleFile.xlsx")

In [16]:
st

   0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468
5  6     Gaston      Brumm    Male  United States   24  21/05/2015  2554
6  7       Etta       Hurn  Female  Great Britain   56  15/10/2017  3598
7  8    Earlean     Melgar  Female  United States   27  16/08/2016  2456
8  9   Vincenza    Weiland  Female  United States   40  21/05/2015  6548

In [19]:
data={
    "Name":["Swaraj","Aditi","Vedanti","Niraj","Sanket"],
    "Age":[21,19,20,20,21],
    "City":["Sangvi","Kothrud","Jalgaon","Bhusawal","Dapodi"]
}

In [20]:
dt=pd.DataFrame(data)
dt.to_excel("exmp.xlsx",index=True)

In [22]:
print("Excel file 'exmp.xlsx' created successfully!")

Excel file 'exmp.xlsx' created successfully!

In [23]:
dt

      Name  Age      City
0   Swaraj   21    Sangvi
1    Aditi   19   Kothrud
2  Vedanti   20   Jalgaon
3    Niraj   20  Bhusawal
4   Sanket   21    Dapodi